## **Handling Naming Inconsistencies**

In [7]:
import pandas as pd
import seaborn as sns

In [8]:
data = {
    'date' : ['20-12-01' , '01-12-2022'],
    'country' : ['USA' , 'U.S.A'] , 
    'name' : [ 'John Doe' , 'Jane Doe'] , 
    'sales_2020' : [100 , 200] ,
    'sales_2021' : [None , 150 ]
}

df = pd.DataFrame(data)

In [9]:
df

         date country      name  sales_2020  sales_2021
0    20-12-01     USA  John Doe         100         NaN
1  01-12-2022   U.S.A  Jane Doe         200       150.0

## **Generate the correct mapping**

In [10]:
country_mapping = {'USA' : 'United States' , 'U.S.A' : 'United States' , 'America' : 'United States'}

## **Apply it to the inconsistent column.**

In [11]:
df['country'] = df['country'].replace(country_mapping)

In [12]:
df

         date        country      name  sales_2020  sales_2021
0    20-12-01  United States  John Doe         100         NaN
1  01-12-2022  United States  Jane Doe         200       150.0